app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "date_posted", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hello"], ["description", "hello dude"], ["date_posted", "2019-01-29"], ["created_at", "2019-01-19 05:20:06.095758"], ["updated_at", "2019-01-19 05:20:06.095758"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "date_posted" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "hello"], ["description", "hello world"], ["date_posted", "2019-01-19"], ["updated_at", "2019-01-19 21:00:16.996234"], ["id", 507]]
---
  def update
    post = Post.find(params[:id])
    post.update_attributes(post_params)